tutorials/pimpleHFDIBFoam/Immersed_Cyl_Static/Cyl_Body_Fitted_New/Embedded_Cyl_Re_20_2D-Mesh1250/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       startTime;
startTime       0;

stopAt          endTime;
endTime         25;

deltaT          0.01;

writeControl    timeStep;
writeInterval   20;

purgeWrite      0;

writeFormat     ascii;
writePrecision  6;
writeCompression off;

timeFormat      general;
timePrecision   6;

runTimeModifiable true;

// ************************************************************************* //

functions
{
    forces
    {
        type            forces;
        libs            ("libforces.so");

        writeControl    timeStep;
        writeInterval   10;

        patches         (cylinderWall);

        pName           p;
        UName           U;

        // For incompressible solvers, use constant reference density:
        rho             rhoInf;
        rhoInf          1000;

        CofR            (0 0 0);
        log             true;
    }

    forceCoeffs
    {
        type            forceCoeffs;
        libs            ("libforces.so");

        writeControl    timeStep;
        writeInterval   10;

        patches         (cylinderWall);

        pName           p;
        UName           U;

        rho             rhoInf;
        rhoInf          1000;

        liftDir         (0 1 0);
        dragDir         (1 0 0);
        pitchAxis       (0 0 1);

        CofR            (2 2 0.05);

        // Must match your inlet magnitude:
        magUInf         1;

        // From ParaView bounds (D=1, span Lz=0.1):
        lRef            1.0;
        Aref            0.1;

        log             true;
    }
}

// ************************************************************************* //
