tutorials/pimpleHFDIBFoam/Immersed_Cyl_Static/Cyl_Body_Fitted_New/Embedded_Cyl_Re_20_2D-Mesh1250/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| OpenFOAM: blockMeshDict (OF8)                                              |
\*---------------------------------------------------------------------------*/
 FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}

actions
(
    {
        name    refineCells;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (0 0 -1) (22 4.1 1);
        }
    }
);
